bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
    garudaData.timing.stepPeriod = p;
    garudaData.timing.zcSynced = true;
    garudaData.timing.goodZcCount = (uint16_t)RT_ZC_SYNC_THRESHOLD;
    garudaData.timing.hasPrevZc = false;
    garudaData.timing.stepsSinceLastZc = 0;
    garudaData.timing.commDeadline = (uint16_t)(now + dl);
    garudaData.timing.deadlineActive = true;
#if FEATURE_BEMF_INTEGRATION || FEATURE_ADC_CMP_ZC
    garudaData.timing.deadlineIsZc = true;
#endif
    s_clCoast.active = 0;
}

/* @return true while the coast owns the bridge (caller skips normal CL). */
static bool CL_CoastListenTick(uint16_t vB, uint16_t now)
{
    if (!s_clCoast.active) return false;
    s_clCoast.tick++;

    /* Running mean of the clean BEMF = the rest level (signal average). */
    if (s_clCoast.mean == 0)
        s_clCoast.mean = vB;
    else
        s_clCoast.mean = (uint16_t)((int16_t)s_clCoast.mean
                       + (((int16_t)vB - (int16_t)s_clCoast.mean) >> 4));

    if (s_clCoast.tick >= CL_COAST_SETTLE_TICKS)
    {
        uint16_t hi = (uint16_t)(s_clCoast.mean + CL_COAST_HYST);
        uint16_t lo = (s_clCoast.mean > CL_COAST_HYST)
                    ? (uint16_t)(s_clCoast.mean - CL_COAST_HYST) : 0u;
        uint8_t side = s_clCoast.side;
        if (vB > hi)      side = 1;
        else if (vB < lo) side = 0;

        if (s_clCoast.side == 0xFF)
        {
            s_clCoast.side = side;            /* prime; no event */
        }
        else if (side != s_clCoast.side && side != 0xFF)
        {
            /* Crossing of the rest level (rising if now above). */
            s_clCoast.side = side;
            s_clCoast.lastRising = side;
            if (s_clCoast.nCross > 0)
            {
                uint16_t ivNow =
                    (uint16_t)(s_clCoast.tick - s_clCoast.lastCrossTick);
                /* Plausibility: too-short intervals are diode-ring/noise,
                 * not BEMF — discard (the timer still re-anchors below, so
                 * a later clean crossing measures from the last event). */
                if (ivNow >= CL_COAST_IV_MIN)
                {
                    if (s_clCoast.nIv >= CL_COAST_MAX_IV)
                    {
                        /* Sliding window: early intervals can be mean-bias
                         * artifacts — keep the most recent ones. */
                        uint8_t i;
                        for (i = 1; i < CL_COAST_MAX_IV; i++)
                            s_clCoast.iv[i - 1u] = s_clCoast.iv[i];
                        s_clCoast.nIv = CL_COAST_MAX_IV - 1u;
                    }
                    s_clCoast.iv[s_clCoast.nIv++] = ivNow;
                }
            }
            s_clCoast.lastCrossTick = s_clCoast.tick;
            s_clCoast.nCross++;

            if (s_clCoast.nCross >= CL_COAST_MIN_CROSS && s_clCoast.nIv >= 3)
            {
                /* CONSISTENCY GATE (2026-06-10): while the running mean is
                 * still biased early in the coast, it crosses the BEMF
                 * asymmetrically — ALTERNATING short/long intervals (bench:
                 * the post-sine bridge-cut measured a deterministic 79-tick
                 * period = "5696 eRPM" from a 3k rotor, impossible — all six
                 * runs identical). True BEMF crossings of a converged mean
                 * are uniform. Require the last 3 intervals to agree within
                 * 25% before trusting them; inconsistent → keep listening
                 * (the mean converges, later intervals become uniform);
                 * never consistent → timeout fallback (pre-coast behavior). */
                uint16_t a = s_clCoast.iv[s_clCoast.nIv - 3u];
                uint16_t b = s_clCoast.iv[s_clCoast.nIv - 2u];
                uint16_t c = s_clCoast.iv[s_clCoast.nIv - 1u];
                uint16_t mn = a, mx = a;
                if (b < mn) mn = b;
                if (b > mx) mx = b;
                if (c < mn) mn = c;
                if (c > mx) mx = c;
                if ((uint16_t)(mx - mn) <= (uint16_t)(mn >> 2))
                {
                    uint16_t m = (uint16_t)(a + b + c - mn - mx); /* median */
                    /* B crosses every HALF e-cycle = 3 sector periods. */
                    uint16_t p = (uint16_t)(m / 3u);
                    if (p < MIN_CL_ADC_STEP_PERIOD) p = MIN_CL_ADC_STEP_PERIOD;
                    if (p > RT_INITIAL_ADC_STEP_PERIOD) p = RT_INITIAL_ADC_STEP_PERIOD;

                    /* Sector from polarity: B floats rising in step 2, falling
                     * in step 5; the crossing IS the sector center, so the next
                     * commutation is half a period out. Engaging at the
                     * crossing instant keeps the angle error ≤ one tick. */
                    uint8_t k = s_clCoast.lastRising ? 2u : 5u;
                    CL_CoastEngage(k, p, (uint16_t)(p / 2u), now);
                    return true;
                }
            }
        }
    }

    /* Timeout — couldn't hear enough crossings (too slow / too quiet):
     * blind fallback = the pre-coast behavior (morph-seeded period). */
    if (s_clCoast.tick >= CL_COAST_TIMEOUT_TICKS)
        CL_CoastEngage(garudaData.currentStep,
                       garudaData.timing.stepPeriod,
                       (uint16_t)(garudaData.timing.stepPeriod / 2u), now);
    return true;
}
#endif /* FEATURE_CL_DIFF_IDLE || FEATURE_CL_COAST_VERIFY */

#if FEATURE_OC_AUTOZERO
/* OC auto-zero (2026-06-10): measured bus-ADC rest bias. 2048 = uncalibrated
 * (legacy behavior). Measured during ARMED with the bridge off; re-measured on
 * every disarm→arm. Shared with hal_comparator.c (CMP3 DAC shift). */
volatile uint16_t g_ocBiasAdc = 2048;
static uint16_t s_ocZeroRaw;       /* last UNCORRECTED bus sample (cal input) */
static uint32_t s_ocZeroAcc;
static uint16_t s_ocZeroCount;
static uint16_t s_ocZeroMin;       /* window spread — quiescence gate */
static uint16_t s_ocZeroMax;
#endif

/* Heartbeat LED counter */
static uint16_t heartbeatCounter = 0;
/* Sub-counter for 1ms system tick from 100us Timer1 */
static uint8_t msSubCounter = 0;

#if FEATURE_BEMF_CLOSED_LOOP
/* File-scope statics for ZC — only accessed from ADC ISR, NOT Timer1 ISR */
static uint16_t adcIsrTick = 0;
static ESC_STATE_T prevAdcState = ESC_IDLE;

#if FEATURE_SINE_STARTUP
/* Helper macro: write trap duties for active/float/low phases.
 * Uses virtual neutral (midpoint of active and low) for float phase. */
#define MORPH_WRITE_TRAP_DUTIES(step, activeDuty) do { \
    uint32_t _tf = ((activeDuty) + MIN_DUTY) / 2; \
    const COMMUTATION_STEP_T *_s = &commutationTable[(step)]; \
    uint32_t _dA = (_s->phaseA == PHASE_PWM_ACTIVE) ? (activeDuty) : \
                   (_s->phaseA == PHASE_FLOAT) ? _tf : MIN_DUTY; \
    uint32_t _dB = (_s->phaseB == PHASE_PWM_ACTIVE) ? (activeDuty) : \
                   (_s->phaseB == PHASE_FLOAT) ? _tf : MIN_DUTY; \
    uint32_t _dC = (_s->phaseC == PHASE_PWM_ACTIVE) ? (activeDuty) : \
                   (_s->phaseC == PHASE_FLOAT) ? _tf : MIN_DUTY; \
    HAL_PWM_SetDutyCycle3Phase(_dA, _dB, _dC); \
} while(0)
#endif
#endif

/**
 * @brief Initialize ESC service data to safe defaults.
 */
void GARUDA_ServiceInit(void)
{
    garudaData.state = ESC_IDLE;
    garudaData.throttle = 0;
    garudaData.currentStep = 0;
    garudaData.direction = DIRECTION_DEFAULT;
    garudaData.duty = 0;
    garudaData.vbusRaw = 0;
    garudaData.potRaw = 0;
    garudaData.faultCode = FAULT_NONE;
    garudaData.alignCounter = 0;
    garudaData.rampStepPeriod = RT_INITIAL_STEP_PERIOD;
    garudaData.rampCounter = 0;
    garudaData.systemTick = 0;
    garudaData.armCounter = 0;
    garudaData.runCommandActive = false;
    garudaData.desyncRestartAttempts = 0;
    garudaData.recoveryCounter = 0;

#if !FEATURE_FOC && !FEATURE_FOC_V2 && !FEATURE_FOC_V3 && !FEATURE_FOC_AN1078
    /* Phase-current monitor — start with empty max/min. iaMin initialized
     * to 0xFFFF so the first real sample wins the "less than" comparison. */
    garudaData.phaseCurrent.iaRaw = 0;
    garudaData.phaseCurrent.ibRaw = 0;
    garudaData.phaseCurrent.iaMax = 0;
    garudaData.phaseCurrent.iaMin = 0xFFFF;
    garudaData.phaseCurrent.ibMax = 0;
    garudaData.phaseCurrent.ibMin = 0xFFFF;
    garudaData.phaseCurrent.ibusWinMax = 0;
    garudaData.phaseCurrent.ibusWinMin = 0xFFFF;
    garudaData.phaseCurrent.iaAtFault = 0;
    garudaData.phaseCurrent.ibAtFault = 0;
    garudaData.phaseCurrent.iaMaxAtFault = 0;
    garudaData.phaseCurrent.iaMinAtFault = 0;
    garudaData.phaseCurrent.ibMaxAtFault = 0;
    garudaData.phaseCurrent.ibMinAtFault = 0;
    garudaData.phaseCurrent.ibusAtFault = 0;
    garudaData.phaseCurrent.ibusMaxAtFault = 0;
    garudaData.phaseCurrent.ibusMinAtFault = 0;
    garudaData.phaseCurrent.faultCaptured = 0;
#endif

#if FEATURE_FOC
    /* FOC algorithm state */
    pi_init(&s_pid_d,   KP_DQ,  KI_DQ,  -CLAMP_VDQ,       CLAMP_VDQ);
    pi_init(&s_pid_q,   KP_DQ,  KI_DQ,  -CLAMP_VDQ,       CLAMP_VDQ);
    pi_init(&s_pid_spd, KP_SPD, KI_SPD, -CLAMP_IQ_REF_A,  CLAMP_IQ_REF_A);
    bemf_obs_reset(&s_obs);
    pll_reset(&s_pll);
    flux_est_reset(&s_flux_est);
#if FEATURE_SMO
    smo_reset(&s_smo);
    pll_reset(&s_pll_smo);
#endif
#if FEATURE_MXLEMMING
    mxl_reset(&s_mxl);
#endif
    foc_startup_reset();
    s_iq_ref    = 0.0f;
    s_vbus      = MOTOR_VBUS_NOM_V;
    s_slow_ctr  = 0;
    s_stall_ctr = 0;
    s_ia_accum  = 0;
    s_ib_accum  = 0;
    s_cal_count = 0;
    s_ia_offset = ADC_MIDPOINT;
    s_ib_offset = ADC_MIDPOINT;
    s_cal_done  = false;
#endif

#if FEATURE_FOC_V2
    {
        FOC_MotorParams_t mp = BuildFocMotorParams();
        foc_v2_init(&s_foc_v2, &mp);
        gspFocReinitNeeded = false;
    }
#elif FEATURE_FOC_V3
    {
        FOC_MotorParams_t mp = BuildFocMotorParams();
        foc_v3_init(&s_foc_v3, &mp);
        gspFocReinitNeeded = false;
    }
#elif FEATURE_FOC_AN1078
    {
        AN_MotorInit(&s_foc_an);
        gspFocReinitNeeded = false;
    }
#endif

