bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
#if FEATURE_HWZC_FALLING_SW && FEATURE_HWZC_SECTOR_PI
            /* Hybrid falling detector: the rotor's falling ZC is invisible to
             * the ON-time comparator but present here at OFF-center. Detect the
             * downward crossing of zcThreshold (one accept per sector) and record
             * it into the sector-PI path exactly as the HW comparator does
             * (hwzc.c:549) — OnPiPeriodExpired then uses it. Plausibility floor:
             * only past 1/4 of the period (the falling ZC sits ~mid-sector;
             * rejects early demag dips). Optional speed cap for coarse-resolution
             * top end. */
            if (!garudaData.hwzc.captureValid)
            {
                /* RC-lag compensation, falling branch (added 2026-06-07) — the
                 * HW rising path applies this (hwzc.c:251 / live refresh :726)
                 * but the falling SW path historically didn't, so falling drifted
                 * late vs rising as ω·τ grew. Apply the same per-polarity offset
                 * (falling: thresh + offset) then the falling deadband, so both
                 * polarities are phase-consistent. Magnitude tunes via
                 * HWZC_FILTER_AMP_PCT_FALLING. */
                uint16_t fth = HWZC_ApplyFilterComp(&garudaData,
                                                    garudaData.bemf.zcThreshold,
                                                    false /* falling */);
                fth = (fth > HWZC_CMP_DEADBAND) ? (uint16_t)(fth - HWZC_CMP_DEADBAND) : 0;
                uint32_t zc = HAL_SCCP2_ReadTimestamp();
                uint32_t intoSector = zc - garudaData.hwzc.lastCommStamp;
                bool plausible = intoSector > (garudaData.hwzc.timerPeriod >> 2);
#if HWZC_FALLING_SW_MAX_ERPM > 0
                uint32_t erpmNow = garudaData.hwzc.stepPeriodHR
                    ? HWZC_TICKS_TO_ERPM(garudaData.hwzc.stepPeriodHR) : 0;
                if (erpmNow > HWZC_FALLING_SW_MAX_ERPM) plausible = false;
#endif
                if (plausible && vfo < fth)
                {
                    garudaData.hwzc.lastCaptureHR = zc;
                    garudaData.hwzc.captureValid  = true;
                    garudaData.hwzc.lastZcStamp   = zc;
                    if (garudaData.hwzc.goodZcCount < 0xFFFE)
                        garudaData.hwzc.goodZcCount++;
                    garudaData.hwzc.missCount = 0;
                    garudaData.hwzc.totalZcCount++;
                }
            }
#endif
        }

#if FEATURE_HWZC_LOWSPD_OFFCTR && FEATURE_HWZC_FALLING_SW && FEATURE_HWZC_SECTOR_PI
        /* Phase 1 (OL->CL smooth-handoff plan): detect RISING ZC on the SAME
         * RC-filtered OFF-center (PWM-OFF) sample at low speed, so neither
         * polarity needs the PWM-ON comparator window. This is the enabler for a
         * low-duty hand-off (it removes the reason for the ~6% duty floor).
         * Mirrors the falling detector above with opposite sign. ADDITIVE: the
         * rising HW comparator still runs; first capture per sector wins
         * (!captureValid). Speed-gated (OFF-center res is ~1 PWM period). */
        if (garudaData.hwzc.enabled
            && garudaData.hwzc.phase == HWZC_WATCHING
            && garudaData.bemf.bemfSampleValid
            && commutationTable[garudaData.currentStep].zcPolarity > 0
            && !garudaData.hwzc.captureValid)
        {
            uint32_t erpmNow = garudaData.hwzc.stepPeriodHR
                ? HWZC_TICKS_TO_ERPM(garudaData.hwzc.stepPeriodHR) : 0;
            if (erpmNow > 0 && erpmNow < HWZC_LOWSPD_OFFCTR_MAX_ERPM)
            {
                uint16_t vfo = garudaData.bemf.bemfRaw;
                /* rising threshold: filter-comp + deadband on the HIGH side
                 * (mirror of the falling fth - deadband). Clamp to ADC range. */
                uint16_t rth = HWZC_ApplyFilterComp(&garudaData,
                                                    garudaData.bemf.zcThreshold,
                                                    true /* rising */);
                {
                    uint32_t r = (uint32_t)rth + HWZC_CMP_DEADBAND;
                    rth = (r > 4095u) ? 4095u : (uint16_t)r;
                }
                uint32_t zc = HAL_SCCP2_ReadTimestamp();
                uint32_t intoSector = zc - garudaData.hwzc.lastCommStamp;
                bool plausible = intoSector > (garudaData.hwzc.timerPeriod >> 2);
                if (plausible && vfo > rth)
                {
                    garudaData.hwzc.lastCaptureHR = zc;
                    garudaData.hwzc.captureValid  = true;
                    garudaData.hwzc.lastZcStamp   = zc;
                    if (garudaData.hwzc.goodZcCount < 0xFFFE)
                        garudaData.hwzc.goodZcCount++;
                    garudaData.hwzc.missCount = 0;
                    garudaData.hwzc.totalZcCount++;
                }
            }
        }
#endif
#endif
    }
    adcIsrTick++;

#if FEATURE_ADC_CMP_ZC && HWZC_USE_SW_COMPARE
    /* Software HWZC path: run the ZC compare on the just-captured mid-ON
     * sample. Mid-ON sampling (PG1TRIGA valley) avoids the ~48 kHz phantom
     * rate the HW digital comparator sees on this board (5.5 kHz RC filter
     * can't smooth 24 kHz PWM → ripple crosses threshold every cycle). */
    HWZC_OnSoftwareSample(&garudaData);
#endif

#if !FEATURE_FOC && !FEATURE_FOC_V2 && !FEATURE_FOC_V3 && !FEATURE_FOC_AN1078
    /* Phase-current peak tracking (diagnostic). AD1CH3 / AD2CH2 convert at
     * 24 kHz (PG1TRIGA, mid-ON valley). max/min are the per-sample window
     * peaks; they're reset after each GSP snapshot read (see gsp_snapshot.c).
     * So each telemetry row shows the peaks in the most recent ~20 ms.
     *
     * On CL entry: clear the "frozen-at-fault" snapshot so a new CL run
     * gets a fresh fault capture when/if it trips. */
    {
        if (entryState == ESC_CLOSED_LOOP && prevAdcState != ESC_CLOSED_LOOP) {
            garudaData.phaseCurrent.faultCaptured = 0;
            garudaData.phaseCurrent.iaAtFault = 0;
            garudaData.phaseCurrent.ibAtFault = 0;
            garudaData.phaseCurrent.iaMaxAtFault = 0;
            garudaData.phaseCurrent.iaMinAtFault = 0;
            garudaData.phaseCurrent.ibMaxAtFault = 0;
            garudaData.phaseCurrent.ibMinAtFault = 0;
            garudaData.phaseCurrent.ibusAtFault = 0;
            garudaData.phaseCurrent.ibusMaxAtFault = 0;
            garudaData.phaseCurrent.ibusMinAtFault = 0;
        }
        uint16_t ia = ADCBUF_IA_MON;
        uint16_t ib = ADCBUF_IB_MON;
        garudaData.phaseCurrent.iaRaw = ia;
        garudaData.phaseCurrent.ibRaw = ib;
        if (ia > garudaData.phaseCurrent.iaMax) garudaData.phaseCurrent.iaMax = ia;
        if (ia < garudaData.phaseCurrent.iaMin) garudaData.phaseCurrent.iaMin = ia;
        if (ib > garudaData.phaseCurrent.ibMax) garudaData.phaseCurrent.ibMax = ib;
        if (ib < garudaData.phaseCurrent.ibMin) garudaData.phaseCurrent.ibMin = ib;

        /* Bus-current window tracking — uses the existing garudaData.ibusRaw
         * which is captured later in this ISR, but at this point still holds
         * the PREVIOUS ISR's value (which is fine for window-aggregating). */
#if FEATURE_HW_OVERCURRENT
        uint16_t ibus = garudaData.ibusRaw;
        if (ibus > garudaData.phaseCurrent.ibusWinMax) garudaData.phaseCurrent.ibusWinMax = ibus;
        if (ibus < garudaData.phaseCurrent.ibusWinMin) garudaData.phaseCurrent.ibusWinMin = ibus;
#endif

        /* Freeze a snapshot on the first BOARD_PCI transition of this run.
         * faultCaptured is cleared at CL entry, set once here, so we keep
         * the VERY FIRST fault's currents (not any later re-trip). */
        if (!garudaData.phaseCurrent.faultCaptured
            && garudaData.faultCode == FAULT_BOARD_PCI)
        {
            garudaData.phaseCurrent.iaAtFault    = ia;
            garudaData.phaseCurrent.ibAtFault    = ib;
            garudaData.phaseCurrent.iaMaxAtFault = garudaData.phaseCurrent.iaMax;
            garudaData.phaseCurrent.iaMinAtFault = garudaData.phaseCurrent.iaMin;
            garudaData.phaseCurrent.ibMaxAtFault = garudaData.phaseCurrent.ibMax;
            garudaData.phaseCurrent.ibMinAtFault = garudaData.phaseCurrent.ibMin;
#if FEATURE_HW_OVERCURRENT
            garudaData.phaseCurrent.ibusAtFault    = garudaData.ibusRaw;
            garudaData.phaseCurrent.ibusMaxAtFault = garudaData.phaseCurrent.ibusWinMax;
            garudaData.phaseCurrent.ibusMinAtFault = garudaData.phaseCurrent.ibusWinMin;
#endif
            garudaData.phaseCurrent.faultCaptured = 1;
        }

#if FEATURE_BURST_SCOPE
        /* Stream 6-step diagnostic channels into burst scope ring (24 kHz).
         *
         * Reuses the FOC-oriented SCOPE_SAMPLE_T fields:
         *   ia  = Phase A current (OA1 → AD1CH3) in mA     [accurate]
         *   ib  = Phase B current (OA2 → AD2CH2) in mA     [broken on this
         *         MCLV+EV68M17A combo — reads ~0; kept as sanity channel]
         *   id  = Bus current (OA3/M1_IBUS_FILT) in mA     [REPURPOSED
         *         for 6-step; what U25B actually trips on]
         *   vd  = Vbus in centivolts (raw/10, approx)
         *   vq  = zcThreshold raw
         *   theta = currentStep (sector 0-5)
         *   omega = eRPM / 10 (fits int16 up to 327 kRPM)
         *   mod_index = dutyPct × 100 (0-10000)
         *   flags:  bit0=HWZC enabled, bit1=fault
         *   state:  garudaData.state
         *
         * Scale (shared with phase-current monitor): COUNTS_PER_AMP ADC counts/A
         * (derived from OC_GAIN_X100; ~30 at the corrected 8.3 gain), bias 2048.
         * mA = (raw - 2048) × 1000 / COUNTS_PER_AMP. Clamped to int16 range.
         */
        {
            SCOPE_SAMPLE_T ss;
            int32_t ma;

            ma = ((int32_t)garudaData.phaseCurrent.iaRaw - 2048) * 1000 / COUNTS_PER_AMP;
            if (ma > 32767)  ma = 32767;
            if (ma < -32768) ma = -32768;
            ss.ia = (int16_t)ma;

            ma = ((int32_t)garudaData.phaseCurrent.ibRaw - 2048) * 1000 / COUNTS_PER_AMP;
            if (ma > 32767)  ma = 32767;
            if (ma < -32768) ma = -32768;
            ss.ib = (int16_t)ma;

