bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
#if FEATURE_HW_OVERCURRENT
            ma = ((int32_t)garudaData.ibusRaw - 2048) * 1000 / COUNTS_PER_AMP;
            if (ma > 32767)  ma = 32767;
            if (ma < -32768) ma = -32768;
            ss.id = (int16_t)ma;
#else
            ss.id = 0;
#endif
            ss.iq       = 0;
            ss.vd       = (int16_t)(garudaData.vbusRaw);      /* raw ADC */
            ss.vq       = (int16_t)(garudaData.bemf.zcThreshold);
            ss.theta    = (int16_t)(garudaData.currentStep);
            ss.obs_x1   = (int16_t)(garudaData.bemf.bemfRaw);
            ss.obs_x2   = 0;
            {
                uint32_t erpm_hr = (garudaData.hwzc.enabled && garudaData.hwzc.stepPeriodHR)
                                 ? HWZC_TICKS_TO_ERPM(garudaData.hwzc.stepPeriodHR)
                                 : 0;
                int32_t eRPMscaled = (int32_t)(erpm_hr / 10);
                if (eRPMscaled > 32767) eRPMscaled = 32767;
                ss.omega = (int16_t)eRPMscaled;
            }
            {
                uint32_t dutyPctX100 = (garudaData.duty * 10000U) / LOOPTIME_TCY;
                if (dutyPctX100 > 32767) dutyPctX100 = 32767;
                ss.mod_index = (int16_t)dutyPctX100;
            }
            ss.flags  = (garudaData.hwzc.enabled ? 0x01 : 0x00)
                      | ((garudaData.state == ESC_FAULT) ? 0x02 : 0x00);
            ss.state  = (uint8_t)garudaData.state;
            ss.tick_lsb = (uint16_t)(garudaData.systemTick & 0xFFFF);
            Scope_WriteSample(&ss);
        }
#endif /* FEATURE_BURST_SCOPE */
    }
#endif
#else
#if !FEATURE_FOC && !FEATURE_FOC_V2 && !FEATURE_FOC_V3 && !FEATURE_FOC_AN1078
    garudaData.bemf.bemfRaw = phaseB_val;
    (void)phaseAC_val;  /* AD2CH0DATA must be read; suppress unused warning */
#endif
#endif

    /* Bus voltage fault enforcement (OV/UV) */
#if FEATURE_VBUS_FAULT
    {
        static uint8_t vbusOvCount = 0, vbusUvCount = 0;
        static uint16_t vbusFilt = 0;
        static bool     vbusFiltInit = false;

        if ((garudaData.state >= ESC_ALIGN && garudaData.state <= ESC_CLOSED_LOOP)
            || garudaData.state == ESC_IF_RAMP)   /* I-f spin-up: keep OV/UV active */
        {
            /* Low-pass the single per-ISR bus sample before the OV/UV compare.
             * vbusRaw is one unfiltered ADC reading at the PWM-relative trigger;
             * at high duty it carries brief switching-coupled dips (>=3 samples)
             * that false-trip UV even though the DC bus is steady (bench: 15.9V,
             * Ia~1.3A, yet UV fired with threshold creeping toward ~840-849).
             * A real brownout or regen rise evolves over ms and passes the
             * filter unattenuated, so genuine protection is preserved. Re-seeded
             * each run (init cleared in the else branch) to avoid a stale start. */
#if VBUS_FILT_SHIFT > 0
            if (!vbusFiltInit) { vbusFilt = garudaData.vbusRaw; vbusFiltInit = true; }
            else vbusFilt = (uint16_t)((int16_t)vbusFilt
                          + (((int16_t)garudaData.vbusRaw - (int16_t)vbusFilt) >> VBUS_FILT_SHIFT));
#else
            vbusFilt = garudaData.vbusRaw;
#endif

            if (vbusFilt > RT_VBUS_OVERVOLTAGE_ADC)
            {
                if (++vbusOvCount >= VBUS_FAULT_FILTER)
                {
#if FEATURE_ADC_CMP_ZC
                    if (garudaData.hwzc.enabled)
                        HWZC_Disable(&garudaData);
                    garudaData.hwzc.fallbackPending = false;
#endif
#if FEATURE_HW_OVERCURRENT
                    HAL_CMP3_SetThreshold(RT_OC_CMP3_STARTUP_DAC);
#endif
                    HAL_MC1PWMDisableOutputs();
                    garudaData.state = ESC_FAULT;
                    garudaData.faultCode = FAULT_OVERVOLTAGE;
                    garudaData.runCommandActive = false;
                    LED2 = 0;
                }
            }
            else { vbusOvCount = 0; }

            {
                /* Determine UV threshold: relaxed during pre-sync startup to
                 * tolerate bus sag from CC-limited bench supply. Normal
                 * threshold resumes after ZC sync is achieved. */
                uint16_t uvThreshold = RT_VBUS_UNDERVOLTAGE_ADC;
#if FEATURE_PRESYNC_RAMP
                if (garudaData.state <= ESC_OL_RAMP
                    || (garudaData.state == ESC_CLOSED_LOOP
                        && !garudaData.timing.zcSynced))
                    uvThreshold = RT_VBUS_UV_STARTUP_ADC;
#endif

            if (vbusFilt < uvThreshold)
            {
                if (++vbusUvCount >= VBUS_FAULT_FILTER)
                {
#if FEATURE_ADC_CMP_ZC
                    if (garudaData.hwzc.enabled)
                        HWZC_Disable(&garudaData);
                    garudaData.hwzc.fallbackPending = false;
#endif
#if FEATURE_HW_OVERCURRENT
                    HAL_CMP3_SetThreshold(RT_OC_CMP3_STARTUP_DAC);
#endif
                    HAL_MC1PWMDisableOutputs();
                    garudaData.state = ESC_FAULT;
                    garudaData.faultCode = FAULT_UNDERVOLTAGE;
                    garudaData.runCommandActive = false;
                    LED2 = 0;
                }
            }
            else { vbusUvCount = 0; }
            } /* uvThreshold scope */
        }
        else
        {
            vbusOvCount = 0;
            vbusUvCount = 0;
            vbusFiltInit = false;   /* re-seed filter on next run */
        }
    }
#endif

    /* Bus current sensing and overcurrent protection */
#if FEATURE_HW_OVERCURRENT
#if FEATURE_OC_AUTOZERO
    /* Read AD1CH2DATA — clears data-ready (mandatory on dsPIC33AK) — then
     * re-center into the 2048 frame that every threshold, the window tracker
     * and the host decoder assume. The chain's TRUE rest is ~78 counts, so
     * the correction is ≈ +1970 (no-op until the ARMED cal measures it).
     * Saturates at 4095 ≈ +22A — beyond that is CMP3 hardware territory. */
    {
        uint16_t rawBus = ADCBUF_IBUS;
        s_ocZeroRaw = rawBus;                       /* for the ARMED cal */
#if FEATURE_IBUS_ONCENTER
        /* Pulse-center (active-vector) conduction current swings OA3 BELOW the
         * rest bias, so the deviation is inverted vs the old freewheel sample.
         * Mirror it back into the 2048 frame: positive = motoring conduction. */
        int32_t corr = (2048 + (int32_t)g_ocBiasAdc) - (int32_t)rawBus;
#else
        int32_t corr = (int32_t)rawBus + (2048 - (int32_t)g_ocBiasAdc);
#endif
        if (corr < 0)    corr = 0;
        if (corr > 4095) corr = 4095;
        garudaData.ibusRaw = (uint16_t)corr;
    }
#else
    /* Read AD1CH2DATA — clears data-ready (mandatory on dsPIC33AK) */
    garudaData.ibusRaw = ADCBUF_IBUS;
#endif

    /* Track peak for diagnostics */
    if (garudaData.ibusRaw > garudaData.ibusMax)
        garudaData.ibusMax = garudaData.ibusRaw;

    /* IIR low-pass (EMA, alpha=1/256 -> ~5.7ms TC @45kHz) of the instantaneous
     * conduction sample -> ibusAvg: a smooth trend for the host to display
     * alongside ibusInst. Q8 accumulator seeded at the 2048 bias (=0 A). */
    {
        static int32_t s_ibusAvgAcc = (int32_t)2048 << 8;
        s_ibusAvgAcc += (int32_t)garudaData.ibusRaw - (s_ibusAvgAcc >> 8);
        garudaData.ibusAvg = (uint16_t)(s_ibusAvgAcc >> 8);
    }

