bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
    /* Count CLPCI activity via CLEVT latched event flags.
     * Poll all 3 generators — active PWM phase rotates with commutation.
     * Coarse counter: one 41.7us ADC tick may collapse multiple chop events. */
#if (OC_PROTECT_MODE == 0 || OC_PROTECT_MODE == 2) && OC_CLPCI_ENABLE
    if (PCI_CLIMIT_EVT_PG1 || PCI_CLIMIT_EVT_PG2 || PCI_CLIMIT_EVT_PG3)
    {
        garudaData.clpciTripCount++;
        /* Clear W1C event flags via direct register write (not bitfield RMW)
         * to avoid accidentally clearing other W1C bits in PGxSTAT. */
        PG1STAT = PCI_CLIMIT_EVT_MASK;
        PG2STAT = PCI_CLIMIT_EVT_MASK;
        PG3STAT = PCI_CLIMIT_EVT_MASK;
    }
#endif

#if FEATURE_IBUS_PROBE
    /* Live CMP3 output LEVEL. With the probe DAC forced below the OA3 rest, this
     * should read 1 continuously if CMP3 is wired to OA3 — independent of motor
     * current or the freewheel sample point. 0 = comparator blind to OA3. */
    g_cmp3FireCount = (uint32_t)DAC3CMPbits.CMPSTAT;
#endif

#ifdef ENABLE_PWM_FAULT_PCI
    /* Count transient FPCI trips via FLTEVT latched event flags.
     * With TERM=1 (auto-terminate), board FPCI trips that resolve within
     * one PWM cycle never set FLTACT by the time the ISR runs — but
     * FLTEVT latches the event. Non-zero count = duty being chopped. */
    if (PCI_FAULT_EVT_PG1 || PCI_FAULT_EVT_PG2 || PCI_FAULT_EVT_PG3)
    {
        garudaData.fpciTripCount++;
        PG1STAT = PCI_FAULT_EVT_MASK;
        PG2STAT = PCI_FAULT_EVT_MASK;
        PG3STAT = PCI_FAULT_EVT_MASK;
    }
#endif

    /* Software hard fault — immediate shutdown (Mode 2 only).
     * DEBOUNCED 3 consecutive samples (2026-06-10): a single garbage bus-ADC
     * sample (the readout spikes to the rail at random transition moments —
     * bench: +22A reads with the bridge OFF) was latching phantom OC_SW and
     * killing healthy runs. Real overcurrent is sustained for ≫3 ADC ticks
     * (~67µs), and the truly fast events belong to the CMP3 HARDWARE
     * comparator layer anyway — the software check is the slow backstop. */
#if OC_PROTECT_MODE == 2
    {
        static uint8_t s_ocFaultDebounce = 0;
        if (garudaData.ibusRaw > OC_FAULT_ADC_VAL)
        {
            if (s_ocFaultDebounce < 255u) s_ocFaultDebounce++;
        }
        else
            s_ocFaultDebounce = 0;

    if (s_ocFaultDebounce >= 3u
        && ((garudaData.state >= ESC_ALIGN
             && garudaData.state <= ESC_CLOSED_LOOP)
            || garudaData.state == ESC_IF_RAMP))   /* protect I-f spin-up too */
    {
#if FEATURE_ADC_CMP_ZC
        if (garudaData.hwzc.enabled)
            HWZC_Disable(&garudaData);
        garudaData.hwzc.fallbackPending = false;
#endif
        HAL_MC1PWMDisableOutputs();
        garudaData.state = ESC_FAULT;
        garudaData.faultCode = FAULT_OVERCURRENT;
        garudaData.runCommandActive = false;
        LED2 = 0;
    }
    }  /* debounce scope */
#endif
#endif /* FEATURE_HW_OVERCURRENT */

#if FEATURE_PHASE_STALL_FAULT
    /* WS2: phase-current stall/desync backstop. The bus-current OC above is
     * blind to a freewheeling phantom lock (current circulates in the phase,
     * bus reads ~0). Watch PHASE current instead: if |ia| or |ib| stays above a
     * high threshold for stallDebounceMs while in closed loop, the rotor is
     * almost certainly desynced/stalled with the bridge pumping current into it
     * — latch FAULT_STALL and kill the bridge. iaRaw/ibRaw are sampled earlier
     * in this ISR (bias 2048); threshold is RAW counts (gain-independent), set
     * near the op-amp rail so normal load does not trip. */
    {
        static uint16_t s_stallDebounce = 0;
        static uint16_t s_iMagPeak      = 0;   /* leaky peak-hold of |Iphase| */
        static bool     s_stallArmed    = false; /* WS2 arm latch (see below) */
        int16_t iaDev = (int16_t)garudaData.phaseCurrent.iaRaw - 2048;
        int16_t ibDev = (int16_t)garudaData.phaseCurrent.ibRaw - 2048;
        uint16_t iaMag = (uint16_t)(iaDev < 0 ? -iaDev : iaDev);
        uint16_t ibMag = (uint16_t)(ibDev < 0 ? -ibDev : ibDev);
        uint16_t iMag  = (iaMag > ibMag) ? iaMag : ibMag;

        if (garudaData.state == ESC_CLOSED_LOOP)
        {
            /* ARM GATE: a heavy-rotor startup accelerating away from the 2500
             * eRPM OL→CL handoff and a stuck phantom both sit at ~18A, so
             * current magnitude alone cannot tell them apart. The discriminator
             * is speed: a real startup CLIMBS, a phantom stays stuck. Don't
             * evaluate stall until the rotor has crossed stallArmErpm once;
             * after that it stays armed for the rest of the run, so a later
             * running desync (eRPM collapses + current rails) is still caught.
             * arm=0 ⇒ arm immediately (legacy behavior). */
            uint32_t erpmNow = garudaData.hwzc.stepPeriodHR
                ? HWZC_TICKS_TO_ERPM(garudaData.hwzc.stepPeriodHR) : 0;
            if (!s_stallArmed && erpmNow >= (uint32_t)RT_STALL_ARM_ERPM)
                s_stallArmed = true;

            /* Leaky peak-hold: the per-ISR sample drops into freewheel/
             * floating-phase notches each commutation, so a hard threshold on
             * the raw value would let a sustained phantom (steady high PEAK,
             * notchy instantaneous) slip through — the notches kept resetting
             * the debounce. Track a peak that rises instantly and decays ~1
             * count/ISR (~45k/s): a real phantom refreshes it every commutation
             * so it stays pinned; a brief inrush/re-sync spike decays out well
             * inside the debounce window. */
            if (iMag > s_iMagPeak)      s_iMagPeak = iMag;
            else if (s_iMagPeak > 0)    s_iMagPeak--;

            /* DUTY GATE (bench 2026-07-03): two false stalls at 12%/4% duty -
             * hard accel at low duty draws >12A phase legitimately, and the
             * low-duty sampling artifact (see WS1 gate) inflates the read.
             * Phantom locks hold high COMMANDED duty (52%), so only ACCUMULATE
             * debounce above the same duty floor as WS1. Below it the debounce
             * FREEZES (not resets): the phantom's duty flaps 52<->5%, and a
             * reset would let it re-zero the count every flap. */
            bool dutyHigh = ((uint32_t)garudaData.duty * 100u
                          >= (uint32_t)RT_ZC_DEMAG_DUTY_THRESH * (uint32_t)LOOPTIME_TCY);
            if (s_stallArmed && s_iMagPeak > RT_STALL_IPHASE_ADC)
            {
                uint16_t stallTicks = (uint16_t)RT_STALL_DEBOUNCE_MS
                                    * (uint16_t)(PWMFREQUENCY_HZ / 1000u);
                if (dutyHigh && s_stallDebounce < 0xFFFFu) s_stallDebounce++;
                if (s_stallDebounce >= stallTicks)
                {
#if FEATURE_ADC_CMP_ZC
                    if (garudaData.hwzc.enabled) HWZC_Disable(&garudaData);
                    garudaData.hwzc.fallbackPending = false;
#endif
                    HAL_MC1PWMDisableOutputs();
                    garudaData.state = ESC_FAULT;
                    garudaData.faultCode = FAULT_STALL;
                    garudaData.runCommandActive = false;
                    LED2 = 0;
                }
            }
            else
            {
                s_stallDebounce = 0;
            }
        }
        else
        {
            /* Not in closed loop — clear everything so OL_RAMP/ALIGN inrush
             * (legit 17-18A) never seeds the CL peak/debounce, and so the arm
             * latch re-evaluates from scratch on the next CL entry. */
            s_stallDebounce = 0;
            s_iMagPeak      = 0;
            s_stallArmed    = false;
        }
    }
#endif /* FEATURE_PHASE_STALL_FAULT */

