bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
#if FEATURE_HW_OVERCURRENT
                /* Current-proportional duty reduction during convergence.
                 * Same logic as CL SW OC limiter but applied to all 3 phases. */
                if (garudaData.ibusRaw > OC_SW_LIMIT_ADC)
                {
                    uint16_t excess = garudaData.ibusRaw - OC_SW_LIMIT_ADC;
                    uint16_t range = RT_OC_CMP3_DAC_VAL - OC_SW_LIMIT_ADC;
                    if (range == 0) range = 1;
                    /* Scale factor: 256 = no reduction, 0 = full cut */
                    uint32_t scale = 256;
                    uint32_t reduction = ((uint32_t)excess * 256u) / range;
                    if (reduction >= scale)
                        scale = 0;
                    else
                        scale -= reduction;
                    dA = (dA * scale) >> 8;
                    dB = (dB * scale) >> 8;
                    dC = (dC * scale) >> 8;
                    if (dA < MIN_DUTY) dA = MIN_DUTY;
                    if (dB < MIN_DUTY) dB = MIN_DUTY;
                    if (dC < MIN_DUTY) dC = MIN_DUTY;
                }
#endif
                HAL_PWM_SetDutyCycle3Phase(dA, dB, dC);

                if (STARTUP_MorphCheckSectorBoundary(&garudaData))
                {
                    if (garudaData.morph.alpha >= 256)
                    {
                        /* Convergence complete → enter Windowed Hi-Z */
                        garudaData.morph.alpha = 256;
                        garudaData.morph.subPhase = MORPH_WINDOWED_HIZ;
                        garudaData.morph.sectorCount = 0;
                        garudaData.morph.tickInStep = 0;
                        garudaData.morph.floatIsHiZ = false;
                        garudaData.morph.morphZcCount = 0;
                        garudaData.morph.forceThreshSeed = true;
                        garudaData.sine.active = false;

                        /* Apply 6-step via commutation module, then release float */
                        COMMUTATION_ApplyStep(&garudaData,
                                              garudaData.morph.morphStep);
                        HAL_PWM_ReleaseFloatPhase(garudaData.currentStep);

                        /* COAST: hold duty at MIN_DUTY during MORPH sub-B (windowed
                         * Hi-Z) so the bridge applies near-zero voltage to the rotor
                         * while HWZC captures clean ZCs. Was: garudaData.duty = trap_duty
                         * (= sineRampModPct × 16/5 clamped to RAMP_DUTY_CAP = 8%), but
                         * 8% Vbus (1.92V) applied to a rotor at 3k eRPM (BEMF=0.31V)
                         * = 22A across 0.05Ω. Coasting at MIN_DUTY for sub-B (~13ms
                         * at 3k eRPM through 4 sectors) lets the rotor stay near 3k
                         * (windage decel negligible over 13ms) while HWZC PI converges.
                         * Then CL takes over with mappedDuty slewing up from MIN_DUTY.
                         * The trap-duty `td` is still computed below for the float-
                         * phase virtual-neutral, which still needs the trap reference. */
                        uint32_t td = ((uint32_t)garudaData.sine.amplitude
                            * SINE_TRAP_DUTY_NUM + SINE_TRAP_DUTY_DEN / 2)
                            / SINE_TRAP_DUTY_DEN;
                        if (td < MIN_DUTY) td = MIN_DUTY;
                        if (td > RT_RAMP_DUTY_CAP) td = RT_RAMP_DUTY_CAP;
                        garudaData.duty = MIN_DUTY;

                        /* Float driven at trapFloat — virtual neutral */
                        uint32_t trapFloat = (td + MIN_DUTY) / 2;
                        const COMMUTATION_STEP_T *s =
                            &commutationTable[garudaData.currentStep];
                        uint32_t dA = (s->phaseA == PHASE_PWM_ACTIVE) ? td :
                                      (s->phaseA == PHASE_FLOAT) ? trapFloat : MIN_DUTY;
                        uint32_t dB = (s->phaseB == PHASE_PWM_ACTIVE) ? td :
                                      (s->phaseB == PHASE_FLOAT) ? trapFloat : MIN_DUTY;
                        uint32_t dC = (s->phaseC == PHASE_PWM_ACTIVE) ? td :
                                      (s->phaseC == PHASE_FLOAT) ? trapFloat : MIN_DUTY;
                        HAL_PWM_SetDutyCycle3Phase(dA, dB, dC);

                        /* Seed forced timing + snapshot */
                        uint16_t handoff =
                            TIMER1_TO_ADC_TICKS(garudaData.rampStepPeriod);
                        garudaData.timing.stepPeriod = handoff;
                        garudaData.timing.forcedCountdown = handoff;
                        garudaData.morph.stepPeriodSnap = handoff;

                        BEMF_ZC_Init(&garudaData, handoff);
                        BEMF_ZC_OnCommutation(&garudaData, adcIsrTick);
                    }
                }
            }
            else if (garudaData.morph.subPhase == MORPH_WINDOWED_HIZ)
            {
                static const uint8_t windowSchedule[] = MORPH_WINDOW_SCHEDULE;

                garudaData.morph.tickInStep++;

                /* --- Window bounds from SNAPSHOT period --- */
                uint8_t schedIdx = garudaData.morph.sectorCount;
                if (schedIdx >= MORPH_WINDOW_SECTORS)
                    schedIdx = MORPH_WINDOW_SECTORS - 1;
                uint8_t pct = windowSchedule[schedIdx];
                uint16_t sp = garudaData.morph.stepPeriodSnap;
                uint16_t width = (uint16_t)(((uint32_t)sp * pct + 50) / 100);

                /* fix #4: enforce minimum absolute window width */
                if (width < MORPH_WINDOW_MIN_TICKS && pct < 100)
                    width = MORPH_WINDOW_MIN_TICKS;
                if (width > sp)
                    width = sp;

                uint16_t winOpen = (sp - width) / 2;
                uint16_t winClose = winOpen + width;

                /* --- Window state transitions --- */
                bool inWindow = (garudaData.morph.tickInStep >= winOpen
                              && garudaData.morph.tickInStep < winClose);

                /* At 100%, keep Hi-Z for entire step — no window-close */
                if (pct >= 100)
                    inWindow = true;

