bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
                if (launchNow)
                {
                    /* Armed successfully — transition to ALIGN.
                     * Init before state change: ADC ISR (prio 6) can
                     * preempt Timer1 (prio 5) between the two lines. */
                    STARTUP_Init(&garudaData);
#if FEATURE_IBUS_PROBE
                    /* Bus-current chop probe: keep the sine align ACTIVE (the
                     * proven bridge drive — STARTUP_Init already set sine.active
                     * + released overrides). Hold it in ESC_ALIGN (don't advance)
                     * and sweep the CMP3 chop threshold there. The earlier
                     * SetCommutationStep path never energized the bridge from
                     * this entry → zero current; the sine drive does. */
                    garudaData.state = ESC_ALIGN;
#elif FEATURE_AM32_STARTUP
                    /* AM32-style: no align, no ramp. Seed the listener's
                     * period guess and enter CL; the ADC-ISR entry block
                     * does the one blind kick + HWZC arm (startMotor()
                     * semantics, AM32 main.c:977). */
                    {
                        uint32_t seedErpm = AM32_START_SEED_ERPM;
                        if (seedErpm == 0u)   /* derive from active profile */
                            seedErpm = (2u * RT_RAMP_TARGET_ERPM) / 3u;
                        if (seedErpm < 300u) seedErpm = 300u;
                        garudaData.rampStepPeriod =
                            (uint16_t)ERPM_TO_STEP_TICKS(seedErpm);
                    }
                    g_am32EntryPending = 1;
#if FEATURE_HW_OVERCURRENT
                    HAL_CMP3_SetThreshold(RT_OC_CMP3_DAC_VAL);
#endif
                    garudaData.state = ESC_CLOSED_LOOP;
#elif FEATURE_IF_STARTUP
                    /* I-f self-aligns from the clean override-low bridge state.
                     * STARTUP_Init's SineInit briefly wrote sine duties + released
                     * overrides; IF_StartupInit (same tick) overwrites to balanced
                     * 0V before any sine duty latches, so the sine HOLD never runs
                     * and there's no sine→SVPWM handover. */
                    IF_StartupInit();
                    garudaData.state = ESC_IF_RAMP;
#else
                    garudaData.state = ESC_ALIGN;
#endif
                    LED2 = 1; /* Motor running indicator */
                }   /* if (launchNow) */
            }   /* arm window + launch gate block */
            break;
#endif

        case ESC_ALIGN:
#if FEATURE_IBUS_PROBE
            /* Hold the PROVEN sine align (ignore its completion return so the
             * bridge keeps driving real current ~1.5A), and sweep the CMP3 chop
             * threshold over a FINE 0..3A range (the align current is small).
             * As the pot rises the threshold drops; when it crosses the real
             * current the chop fires → eRPM (trip-rate, hijacked) JUMPS and Ibus
             * DROPS toward the threshold. Trip current: A ≈ 3 × (4095 − thr)/4095.
             * eRPM lighting + Ibus falling = the hardware current chop WORKS. */
            (void)STARTUP_SineAlign(&garudaData);
            PG1LEBbits.LEB = 80u;
            /* INPSEL SCAN (2026-06-13): force DAC3 to 30 (below the OA3 ~78 rest)
             * so the comparator + input should read HIGH on whichever input the
             * op-amp actually lands on. SWEEP THE POT through 5 zones; eRPM
             * (= live CMPSTAT, 10000/0) lights in the zone whose input sees OA3:
             *   pot 0-20%   INPSEL=0  CMP_A = RA5 = OA3OUT   (expected winner)
             *   pot 20-40%  INPSEL=1  CMP_B = RB5 = OA3IN+
             *   pot 40-60%  INPSEL=2  CMP_C = RA6 = OA3IN-
             *   pot 60-80%  INPSEL=3  CMP_D = RA1            (AN957's value)
             *   pot 80-100% INPSEL=4  Bandgap 0.8V — CHAIN SELF-TEST: this MUST
             *               read 10000 (993 > 30). If even THIS stays 0, the
             *               comparator/DAC/CMPSTAT chain is broken, not the input. */
            {
                uint16_t z = garudaData.throttle;
                uint8_t  sel = (z < 819u) ? 0u : (z < 1638u) ? 1u
                             : (z < 2457u) ? 2u : (z < 3276u) ? 3u : 4u;
                DAC3CMPbits.INPSEL = sel;
                DAC3DATbits.DACDAT = 30u;
            }
            break;
#elif FEATURE_FOC || FEATURE_FOC_V2 || FEATURE_FOC_V3 || FEATURE_FOC_AN1078
            /* FOC: alignment handled in ADC ISR. Timer1 is a no-op. */
            break;
#elif FEATURE_SINE_STARTUP
            /* I-f path bypasses ALIGN entirely (ARMED→IF_RAMP), so this only
             * runs in the non-IF build. */
            if (STARTUP_SineAlign(&garudaData))
            {
#if FEATURE_PLL_STARTUP
                /* PLL-from-align: no OL ramp, no morph. Seed the slow
                 * initial period, flag the blind schedule, and enter CL —
                 * the ADC-ISR entry block engages 6-step + HWZC there. */
                garudaData.rampStepPeriod =
                    (uint16_t)ERPM_TO_STEP_TICKS(PLL_START_ERPM0);
                garudaData.hwzc.pllStartActive = 1;
                garudaData.hwzc.pllStartGood = 0;
                garudaData.hwzc.pllPrevCap = 0;
#if FEATURE_HW_OVERCURRENT
                HAL_CMP3_SetThreshold(RT_OC_CMP3_DAC_VAL);
#endif
                garudaData.state = ESC_CLOSED_LOOP;
#else
                garudaData.state = ESC_OL_RAMP;
#endif
            }
            break;
#else
            if (STARTUP_Align(&garudaData))
            {
#if FEATURE_PLL_STARTUP
                /* PLL-from-align over the CLASSIC align: same exit as the
                 * sine-align path — seed slow period, flag the blind
                 * schedule, enter CL (ADC-ISR entry block engages). */
                garudaData.rampStepPeriod =
                    (uint16_t)ERPM_TO_STEP_TICKS(PLL_START_ERPM0);
                garudaData.hwzc.pllStartActive = 1;
                garudaData.hwzc.pllStartGood = 0;
                garudaData.hwzc.pllPrevCap = 0;
#if FEATURE_HW_OVERCURRENT
                HAL_CMP3_SetThreshold(RT_OC_CMP3_DAC_VAL);
#endif
                garudaData.state = ESC_CLOSED_LOOP;
#else
                garudaData.state = ESC_OL_RAMP;
                garudaData.rampCounter = garudaData.rampStepPeriod;
#endif
            }
            break;
#endif

#if FEATURE_IF_STARTUP
        case ESC_IF_RAMP:
            /* I-f spin-up is driven entirely in the ADC ISR; Timer1 is a no-op. */
            break;
#endif

